# Предобработка данных

In [1]:
import pandas as pd

In [2]:
data = pd.read_excel('/Users/air/Downloads/sales_data_sample.xlsx')

In [3]:
data.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107.0,30.0,95.7,2.0,2871.0,2/24/2003 0:00,Shipped,1.0,2.0,2003.0,...,897 Long Airport Avenue,NaN,NYC,NY,10022.0,USA,NaN,Yu,Kwai,Small
1,10121.0,34.0,81.35,5.0,2765-09-01 00:00:00,2003-07-05 00:00:00,Shipped,2.0,5.0,2003.0,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100.0,France,EMEA,Henriot,Paul,Small
2,10134.0,41.0,94.74,2.0,3884.34,2003-01-07 00:00:00,Shipped,3.0,7.0,2003.0,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508.0,France,EMEA,Da Cunha,Daniel,Medium
3,10145.0,45.0,83.26,6.0,3746-07-01 00:00:00,8/25/2003 0:00,Shipped,3.0,8.0,2003.0,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003.0,USA,NaN,Young,Julie,Medium
4,10159.0,49.0,100.0,14.0,5205.27,2003-10-10 00:00:00,Shipped,4.0,10.0,2003.0,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

Изменим для удобства названия столбцов на строчные буквы и разделим слова:

In [4]:
data.columns = data.columns.str.lower()

In [5]:
data.columns

Index(['ordernumber', 'quantityordered', 'priceeach', 'orderlinenumber',
       'sales', 'orderdate', 'status', 'qtr_id', 'month_id', 'year_id',
       'productline', 'msrp', 'productcode', 'customername', 'phone',
       'addressline1', 'addressline2', 'city', 'state', 'postalcode',
       'country', 'territory', 'contactlastname', 'contactfirstname',
       'dealsize'],
      dtype='object')

In [6]:
data.columns = ['order_number', 'quantity_ordered', 'price_each', 'order_line_number', 'sales', 'order_date', 'status','qtr_id', 'month_id', 'year_id', 'product_line', 'msrp', 'product_code', 'customer_name', 'phone', 'adress_line_1', 'adress_line_2', 'city', 'state', 'postal_code', 'country', 'territory', 'contact_lastname', 'contact_firstname', 'deal_size']

---

## Преобразование типов данных

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_number       2823 non-null   float64
 1   quantity_ordered   2823 non-null   float64
 2   price_each         2823 non-null   object
 3   order_line_number  2823 non-null   float64
 4   sales              2823 non-null   object
 5   order_date         2823 non-null   object
 6   status             2823 non-null   object
 7   qtr_id             2823 non-null   float64
 8   month_id           2823 non-null   float64
 9   year_id            2823 non-null   float64
 10  product_line       2823 non-null   object
 11  msrp               2823 non-null   float64
 12  product_code       2823 non-null   object
 13  customer_name      2823 non-null   object
 14  phone              2823 non-null   object
 15  adress_line_1      2823 non-null   object
 16  adress_line_2      302 non-null    object
 17  city               2823 non-null   object
 18  state              1337 non-null   object
 19  postal_code        2747 non-null   object
 20  country            2823 non-null   object
 21  territory          1749 non-null   object
 22  contact_lastname   2823 non-null   object
 23  contact_firstname  2823 non-null   object
 24  deal_size          2823 non-null   object
dtypes: float64(7), object(18)
memory usage: 551.5+ KB

**Изменим тип данных на целочисленный:**

In [8]:
for el in ['order_number', 'quantity_ordered', 'order_line_number', 'qtr_id', 'month_id', 'year_id']:
    data[el] = data[el].astype('int')

**В столбце 'price_each' изменим тип данных на вещественный:**

*У меня возникли трудности некоторыми строками, например, 1717. Посмотрим, что не так:*

In [9]:
data.iloc[1717]

order_number                             10114
quantity_ordered                            24
price_each                 2022-06-30 00:00:00
order_line_number                            1
sales                                   721.44
order_date                 2003-01-04 00:00:00
status                                 Shipped
qtr_id                                       2
month_id                                     4
year_id                                   2003
product_line                      Classic Cars
msrp                                      35.0
product_code                          S24_2840
customer_name        La Corne D'abondance, Co.
phone                           (1) 42.34.2555
adress_line_1          265, boulevard Charonne
adress_line_2                              NaN
city                                     Paris
state                                      NaN
postal_code                            75012.0
country                                 France
territory                                 EMEA
contact_lastname                      Bertrand
contact_firstname                        Marie
deal_size                                Small
Name: 1717, dtype: object

В строке со стоимостью товара указана дата(в других строках аналогичная проблема). Заменим значения в этих строках пропусками:

In [10]:
data['price_each'] = pd.to_numeric(data['price_each'], errors='coerce')

# Выведем данные строки на экран
data[data['price_each'].isna()]

,order_number,quantity_ordered,price_each,order_line_number,sales,order_date,status,qtr_id,month_id,year_id,...,adress_line_1,adress_line_2,city,state,postal_code,country,territory,contact_lastname,contact_firstname,deal_size
1717,10114,24,NaN,1,721.44,2003-01-04 00:00:00,Shipped,2,4,2003,...,"265, boulevard Charonne",NaN,Paris,NaN,75012.0,France,EMEA,Bertrand,Marie,Small
1722,10175,37,NaN,2,1151.44,2003-06-11 00:00:00,Shipped,4,11,2003,...,35 King George,NaN,London,NaN,WX3 6FW,UK,EMEA,Brown,Ann,Small
1725,10207,42,NaN,8,1247.4,2003-09-12 00:00:00,Shipped,4,12,2003,...,6251 Ingle Ln.,NaN,Boston,MA,51003.0,USA,NaN,Franco,Valarie,Small
1732,10292,39,NaN,9,1172.34,2004-08-09 00:00:00,Shipped,3,9,2004,...,897 Long Airport Avenue,NaN,NYC,NY,10022.0,USA,NaN,Yu,Kwai,Small

Пропуски у нас только в четырех строках. Как мы знаем, стоимость одной единицы товара('price_each') = сумма продажи('sales') / количество товара('quantity_ordered'). Таким образом, мы легко можем вычислить данные значения

In [11]:
for num in [1717, 1722, 1725, 1732]:
    data.loc[num, 'price_each'] = pd.to_numeric(data.loc[num, 'sales']) / data.loc[num, 'quantity_ordered']

**Изменим тип данных на вещественный в столбце с суммой заказа('sales'):**

*В данном столбце мы встречаемся с аналогичной проблемой: в некоторых строках указана дата вместо значения.*

Заменим значения, в которых указаны неправильные данные, пропусками:

In [12]:
data['sales'] = pd.to_numeric(data['sales'], errors='coerce')
data['sales'].isna().sum()

737

Сумма заказа('sales') = Строимость одного товара('price_each') * количество товаров('quantity_ordered'). Вычислим данные значения:

In [13]:
data.loc[data['sales'].isna(), 'sales'] = data['price_each'] * data['quantity_ordered']

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_number       2823 non-null   int64
 1   quantity_ordered   2823 non-null   int64
 2   price_each         2823 non-null   float64
 3   order_line_number  2823 non-null   int64
 4   sales              2823 non-null   float64
 5   order_date         2823 non-null   object
 6   status             2823 non-null   object
 7   qtr_id             2823 non-null   int64
 8   month_id           2823 non-null   int64
 9   year_id            2823 non-null   int64
 10  product_line       2823 non-null   object
 11  msrp               2823 non-null   float64
 12  product_code       2823 non-null   object
 13  customer_name      2823 non-null   object
 14  phone              2823 non-null   object
 15  adress_line_1      2823 non-null   object
 16  adress_line_2      302 non-null    object
 17  city               2823 non-null   object
 18  state              1337 non-null   object
 19  postal_code        2747 non-null   object
 20  country            2823 non-null   object
 21  territory          1749 non-null   object
 22  contact_lastname   2823 non-null   object
 23  contact_firstname  2823 non-null   object
 24  deal_size          2823 non-null   object
dtypes: float64(3), int64(6), object(16)
memory usage: 551.5+ KB

**Приведем столбец с датой к формату datetime:**

In [15]:
data.order_date = pd.to_datetime(data.order_date)

**Надем начало и конец исследования:**

In [16]:
data.order_date.min()

Timestamp('2003-01-04 00:00:00')

In [17]:
data.order_date.max()

Timestamp('2005-12-01 00:00:00')

**Проверим на наличие дубликатов:**

In [18]:
data.duplicated().sum()

0

---

## Обработка пропусков

В данных есть пропуски в столбцах 'adress_line_2', 'state', 'postal_code' и 'territory'. Предположительно это не является проблемой с выгрузкой.

 - 'adress_line_2' - это дополнительный адрес, который указывается опционально(предположение)
 - 'state' заполнены только для USA

In [19]:
null_postal_code = data[data['postal_code'].isna()]
null_postal_code.groupby('country').agg({'order_number':'count'})

         order_number
country
USA                76

Все пропущенные значения с почтовым индексом('postal_code') в заказах из США. Возможно это связано со спецификой адресов в стране. В любом случае, эти данные не являются необходимыми для исследования.


Посмотрим пропущенные значения по региону:

In [20]:
null_territory = data[data['territory'].isna()]
null_territory.groupby('country').agg({'order_number':'count'})

         order_number
country
Canada             70
USA              1004

In [21]:
data.territory.unique()

array([nan, 'EMEA', 'APAC', 'Japan'], dtype=object)

Пропущенные значения в столбце с регионом относятся к Канаде и США. EMEA и APAC - это обозначения экономических регионов Европы, Ближнего Востока и Африки и Азиатско-Тихоокеанского региона. США и Канада относятся к Северо-Американскому региону, поэтому мы можем заменить пропуски в данном столбце обозначением 'NA'(North-America)





*information from https://help.adjust.com/en/article/countries-by-region*

In [22]:
data.territory = data.territory.fillna('NA')

В данном случае вопрос вызывает регион 'Japan', потому что Япония относится к региону APAC и не выделяется в отдельный регион.

In [23]:
jp = data[data['territory'] == 'Japan']
jp.country.unique()

array(['Singapore', 'Japan', 'Philippines'], dtype=object)

На самом деле, все эти три страны относятся к Азиатско-Тихоокеанскому региону, не совсем понятно, по какому принципу они были отнесены к Японии. Для четкости структуры и правильному вычислению статистики по регионам я отнесу эти страны к региону APAC.

In [24]:
for element in ['Singapore', 'Japan', 'Philippines']:
    data.loc[data['country'] == element, 'territory'] = 'APAC'

In [25]:
data.territory.unique()

array(['NA', 'EMEA', 'APAC'], dtype=object)

## Вывод:

 - В ходе предобработки данных для удобства анализа были изменены названия столбцов(регистр и разделения на слова).
 - Были преобразованы типы данных, необходимые данные были вычислены.
 - Дубликатов в данных не обнаружено.
 - Были заполнены некоторые пропуски(столбец 'territory'), пропуски в других столбцах не влияют на анализ, поэтому были оставлены без изменений.

In [387]:
data.to_csv('/Users/air/Downloads/data.csv')